
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("ПолноеНаименование") Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.ПолноеНаименование; //Лев(СтрЗаменить(Данные.НомерКарты, " ", ""), 4) + " " + Прав(СтрЗаменить(Данные.НомерКарты, " ", ""), СтрДлина(СтрЗаменить(Данные.НомерКарты, " ", "")) - 4);
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ПолноеНаименование");
	
КонецПроцедуры
